In [1]:
# Import dependencies
import pandas as pd
import numpy as np
pd.set_option('max_colwidth', 400)

In [2]:
nba_df = pd.read_csv('../NBA_Demographics.csv')

In [4]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 31 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rk      4688 non-null   int64
 1   Player  4688 non-null   object
 2   Yrs     4688 non-null   int64
 3   From    4688 non-null   int64
 4   To      4688 non-null   int64
 5   G       4688 non-null   int64
 6   MP      4395 non-null   float64
 7   FG      4688 non-null   int64
 8   FGA     4688 non-null   int64
 9   3P      3759 non-null   float64
 10  3PA     3759 non-null   float64
 11  FT      4688 non-null   int64
 12  FTA     4688 non-null   int64
 13  ORB     3945 non-null   float64
 14  TRB     4443 non-null   float64
 15  AST     4688 non-null   int64
 16  STL     3761 non-null   float64
 17  BLK     3761 non-null   float64
 18  TOV     3842 non-null   float64
 19  PF      4688 non-null   int64
 20  PTS     4688 non-null   int64
 21  FG%     4659 non-null   float64
 22  3P%     3301 non-null   float64
 23  FT%     4480 non-null   float64
 24  MP.1    4395 non-null   float64
 25  PTS.1   4688 non-null   float64
 26  TRB.1   4443 non-null   float64
 27  AST.1   4688 non-null   float64
 28  Date    4686 non-null   object
 29  City    4659 non-null   object
 30  Region  4688 non-null   object
dtypes: float64(15), int64(12), object(4)
memory usage: 1.1+ MB

In [9]:
#df.rename(columns={"A": "a", "B": "c"})
#df.drop(columns=['B', 'C'])
nba_df = nba_df.drop(columns=['G','MP', 'FG', 'FGA', '3P', '3PA', 'FT', 'FTA', 'ORB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'FG%', '3P%', 'FT%', 'MP.1', 'PTS.1', 'TRB.1', 'AST.1'])

In [10]:
nba_df.head(5)

,Rk,Player,Yrs,From,To,PTS,Date,City,Region
0,1,Michael Ansley,3,1990,1992,1026,"Feb 8, 1967",Birmingham,Alabama
1,2,Keith Askins,9,1991,1999,1852,"Dec 15, 1967",Athens,Alabama
2,3,Carl Bailey,1,1982,1982,2,"Apr 23, 1958",Birmingham,Alabama
3,4,Charles Barkley*,16,1985,2000,23757,"Feb 20, 1963",Leeds,Alabama
4,5,Eric Bledsoe,12,2011,2022,10348,"Dec 9, 1989",Birmingham,Alabama

In [12]:
nba_df = nba_df.rename(columns={"Rk": "Rank", "Yrs": "Years_Played", "From": "Start_Year", "To":"End_Date", "PTS": "Points", "Region": "State"})

In [13]:
nba_df.head(5)

,Rank,Player,Years_Played,Start_Year,End_Date,Points,Date,City,State
0,1,Michael Ansley,3,1990,1992,1026,"Feb 8, 1967",Birmingham,Alabama
1,2,Keith Askins,9,1991,1999,1852,"Dec 15, 1967",Athens,Alabama
2,3,Carl Bailey,1,1982,1982,2,"Apr 23, 1958",Birmingham,Alabama
3,4,Charles Barkley*,16,1985,2000,23757,"Feb 20, 1963",Leeds,Alabama
4,5,Eric Bledsoe,12,2011,2022,10348,"Dec 9, 1989",Birmingham,Alabama

In [14]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          4688 non-null   int64
 1   Player        4688 non-null   object
 2   Years_Played  4688 non-null   int64
 3   Start_Year    4688 non-null   int64
 4   End_Date      4688 non-null   int64
 5   Points        4688 non-null   int64
 6   Date          4686 non-null   object
 7   City          4659 non-null   object
 8   State         4688 non-null   object
dtypes: int64(5), object(4)
memory usage: 329.8+ KB

In [16]:
from datetime import datetime as dt
#df['date'] = pd.to_datetime(df['date'])
#campaign_df['launched_date'] = pd.to_datetime(campaign_df['launched_date'], unit='s').dt.strftime('%Y-%m-%d')
nba_df['Date']= pd.to_datetime(nba_df['Date']).dt.strftime('%Y-%m-%d')

In [17]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4688 entries, 0 to 4687
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          4688 non-null   int64
 1   Player        4688 non-null   object
 2   Years_Played  4688 non-null   int64
 3   Start_Year    4688 non-null   int64
 4   End_Date      4688 non-null   int64
 5   Points        4688 non-null   int64
 6   Date          4686 non-null   object
 7   City          4659 non-null   object
 8   State         4688 non-null   object
dtypes: int64(5), object(4)
memory usage: 329.8+ KB